Revit 2026 API

# CutMarkSymbol Enumeration

---

The available shapes for the cut mark symbol.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum CutMarkSymbol
```
```vb
Public Enumeration CutMarkSymbol
```
```cpp
public enum class CutMarkSymbol
```
```fsharp
type CutMarkSymbol
```

| Member name | Value | Description |
| --- | --- | --- |
| Curve | 2 | Cut mark shape is curved. |
| None | 0 | Cut mark shape is linear. |
| Zigzag | 1 | Cut mark shape is zigzagged. |

#### Reference

Autodesk.Revit.DB.Architecture Namespace